food-channel-controller/artillery_load_test.yml
config:
  target: "http://127.0.0.1:1422"
  phases:
    - duration: 1
      arrivalRate: 200

scenarios:
  - flow:
      - get:
          url: "/api/v1/channel-order-foods/orders?is_app_food=1&branch_id=3718&restaurant_id=2244&area_id=-1&is_have_restaurant_order=0&channel_order_food_id=-1&restaurant_brand_id=2982&customer_order_status=0%2C8"
          headers:
            Authorization: "Bearer a9a3dc2a-9b5d-42d2-95a1-245ca7392cb1"
            ProjectId: "1422"
            Method: "0"